In [1]:
import pandas as pd
import numpy as np

In [6]:
data = {
    'Empresa':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Nome': ['Sam', 'Charlite', 'Amy', 'Vanessa', 'Car', 'Sarah'],
    'Vendas': [200, 120, 340, 124, 243, 350]
    
}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

  Empresa      Nome  Vendas
0    GOOG       Sam     200
1    GOOG  Charlite     120
2    MSFT       Amy     340
3    MSFT   Vanessa     124
4      FB       Car     243
5      FB     Sarah     350

In [10]:
grupo = df.groupby('Empresa')

In [11]:
grupo

In [12]:
grupo.sum()

         Vendas
Empresa
FB          593
GOOG        320
MSFT        464

In [13]:
grupo.mean()

         Vendas
Empresa
FB        296.5
GOOG      160.0
MSFT      232.0

In [15]:
grupo.describe()

        Vendas
         count   mean         std    min     25%    50%     75%    max
Empresa
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [17]:
grupo.count()

         Nome  Vendas
Empresa
FB          2       2
GOOG        2       2
MSFT        2       2

In [18]:
nome = df.groupby('Nome')

In [19]:
nome.sum()

          Vendas
Nome
Amy          340
Car          243
Charlite     120
Sam          200
Sarah        350
Vanessa      124

In [20]:
nome.sum().loc['Sarah']

Vendas    350
Name: Sarah, dtype: int64

In [21]:
     nome.sum().loc['Car']

Vendas    243
Name: Car, dtype: int64